#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dark-contoso/terraform-development/runs/run-jUmnBcwZZuvgW4qb

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.rg-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002]
azurerm_resource_group.rg-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001]
azurerm_public_ip.bastion-pip-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/publicIPAddresses/pip-bastion-vnet-sn-002]
azurerm_network_security_group.nsg-serversubnet-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/networkSecurityGroups/nsg-serversubnet-vnet-sn-002]
azurerm_network_security_group.nsg-bastionsubnet-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/networkSecurityGroups/nsg-bastionsubnet-vnet-sn-002]
azurerm_network_security_group.nsg-firewallsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-firewallsubnet-vnet-sn-001]
azurerm_network_security_group.nsg-servicessubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-servicessubnet-vnet-sn-001]
azurerm_network_security_group.nsg-firewallmgmtsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-firewallpublicsubnet-vnet-sn-001]
azurerm_network_security_group.nsg-firewallpublicsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-firewallpublicsubnet-vnet-sn-001]
azurerm_network_security_group.nsg-managementsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-managementsubnet-vnet-sn-001]
azurerm_network_security_group.nsg-applicationsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-applicationsubnet-vnet-sn-001]
azurerm_network_security_group.nsg-bastionsubnet-vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/networkSecurityGroups/nsg-bastionsubnet-vnet-sn-001]
azurerm_virtual_network.vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002]
azurerm_virtual_network.vnet-1: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-001/providers/Microsoft.Network/virtualNetworks/vnet-sn-001]
azurerm_subnet.bastion-subnet-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002/subnets/AzureBastionSubnet]
azurerm_bastion_host.bastion-vnet-2: Refreshing state... [id=/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/bastionHosts/bastion-vnet-sn-002]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_virtual_network.vnet-2 will be updated in-place
  ~ resource "azurerm_virtual_network" "vnet-2" {
        address_space       = [
            "10.11.0.0/16",
        ]
        dns_servers         = []
        guid                = "a4dd262d-7fe8-4af2-9994-7c5b5de1f5c0"
        id                  = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002"
        location            = "switzerlandnorth"
        name                = "vnet-sn-002"
        resource_group_name = "rg-vnet-sn-002"
      ~ subnet              = [
          - {
              - address_prefix = "10.11.1.0/24"
              - id             = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002/subnets/GatewaySubnet"
              - name           = "GatewaySubnet"
              - security_group = ""
            },
          + {
              + address_prefix = "10.11.1.0/24"
              + id             = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002/subnets/GatewaySubnet"
              + name           = "GatewaySubnet"
              + security_group = null
            },
          - {
              - address_prefix = "10.11.2.0/24"
              - id             = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002/subnets/AzureBastionSubnet"
              - name           = "AzureBastionSubnet"
              - security_group = ""
            },
            {
                address_prefix = "10.11.3.0/24"
                id             = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/virtualNetworks/vnet-sn-002/subnets/Serversubnet"
                name           = "Serversubnet"
                security_group = "/subscriptions/e7933ac0-8efa-46fa-9d1e-929ae1dd5e24/resourceGroups/rg-vnet-sn-002/providers/Microsoft.Network/networkSecurityGroups/nsg-serversubnet-vnet-sn-002"
            },
        ]
        tags                = {
            "CreatedBy"   = "lrottach@darkcontoso.io"
            "CreatedOn"   = "03/11/2020"
            "Environment" = "Production"
        }
    }

  # azurerm_virtual_network_peering.peering-1-to-2 will be created
  + resource "azurerm_virtual_network_peering" "peering-1-to-2" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering_vnet-1_vnet-2"
      + remote_virtual_network_id    = "vnet-sn-002"
      + resource_group_name          = "rg-vnet-sn-001"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vnet-sn-001"
    }

  # azurerm_virtual_network_peering.peering-2-to-1 will be created
  + resource "azurerm_virtual_network_peering" "peering-2-to-1" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "peering_vnet-2_vnet-1"
      + remote_virtual_network_id    = "vnet-sn-001"
      + resource_group_name          = "rg-vnet-sn-002"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "vnet-sn-002"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>
*Pusher: @lrottach, Action: `pull_request`*